// Написать программу, которая на вход принимает число и выдаёт его квадрад.
// (число умноженное на само себя).

int number = 9;
int result = number * number;
Console.WriteLine(result);

